var $ProvsArr=new Array();
$ProvsArr[11]="北京";
$ProvsArr[12]="天津";
$ProvsArr[13]="河北";
$ProvsArr[14]="山西";
$ProvsArr[15]="内蒙古";
$ProvsArr[21]="辽宁";
$ProvsArr[22]="吉林";
$ProvsArr[23]="黑龙江";
$ProvsArr[31]="上海";
$ProvsArr[32]="江苏";
$ProvsArr[33]="浙江";
$ProvsArr[34]="安徽";
$ProvsArr[35]="福建";
$ProvsArr[36]="江西";
$ProvsArr[37]="山东";
$ProvsArr[41]="河南";
$ProvsArr[42]="湖北";
$ProvsArr[43]="湖南";
$ProvsArr[44]="广东";
$ProvsArr[45]="广西";
$ProvsArr[46]="海南";
$ProvsArr[50]="重庆";
$ProvsArr[51]="四川";
$ProvsArr[52]="贵州";
$ProvsArr[53]="云南";
$ProvsArr[54]="西藏";
$ProvsArr[61]="陕西";
$ProvsArr[62]="甘肃";
$ProvsArr[63]="青海";
$ProvsArr[64]="宁夏";
$ProvsArr[65]="新疆";
$ProvsArr[71]="台湾";
$ProvsArr[81]="香港";
$ProvsArr[82]="澳门";



var $CityArr=new Array()
$CityArr[11]=new Array("东城|1101","西城|1102","崇文|1103","宣武|1104","朝阳|1105","丰台|1106","石景山|1107","海淀|1108","门头沟|1109","房山|1111","通州|1112","顺义|1113","昌平|1114","大兴|1115","怀柔|1116","平谷|1117","密云|1128","延庆|1129");
$CityArr[12]=new Array("和平|1201","河东|1202","河西|1203","南开|1204","河北|1205","红桥|1206","东丽|1210","西青|1211","津南|1212","北辰|1213","武清|1214","宝坻|1215","滨海新区|1216","宁河|1221","静海|1223","蓟县|1225");
$CityArr[13]=new Array("石家庄|1301","唐山|1302","秦皇岛|1303","邯郸|1304","邢台|1305","保定|1306","张家口|1307","承德|1308","沧州|1309","廊坊|1310","衡水|1311");
$CityArr[14]=new Array("太原|1401","大同|1402","阳泉|1403","长治|1404","晋城|1405","朔州|1406","晋中|1407","运城|1408","忻州|1409","临汾|1410","吕梁|1411");
$CityArr[15]=new Array("呼和浩特|1501","包头|1502","乌海|1503","赤峰|1504","通辽|1505","鄂尔多斯|1506","呼伦贝尔|1507","巴彦淖尔|1508","乌兰察布|1509","兴安|1522","锡林郭勒|1525","阿拉善|1529");
$CityArr[21]=new Array("沈阳|2101","大连|2102","鞍山|2103","抚顺|2104","本溪|2105","丹东|2106","锦州|2107","营口|2108","阜新|2109","辽阳|2110","盘锦|2111","铁岭|2112","朝阳|2113","葫芦岛|2114");
$CityArr[22]=new Array("长春|2201","吉林|2202","四平|2203","辽源|2204","通化|2205","白山|2206","松原|2207","白城|2208","延边|2224");
$CityArr[23]=new Array("哈尔滨|2301","齐齐哈尔|2302","鸡西|2303","鹤岗|2304","双鸭山|2305","大庆|2306","伊春|2307","佳木斯|2308","七台河|2309","牡丹江|2310","黑河|2311","绥化|2312","大兴安岭|2327");
$CityArr[31]=new Array("黄浦|3101","卢湾|3103","徐汇|3104","长宁|3105","静安|3106","普陀|3107","闸北|3108","虹口|3109","杨浦|3110","闵行|3112","宝山|3113","嘉定|3114","浦东新区|3115","金山|3116","松江|3117","青浦|3118","奉贤|3120","崇明|3130");
$CityArr[32]=new Array("南京|3201","无锡|3202","徐州|3203","常州|3204","苏州|3205","南通|3206","连云港|3207","淮安|3208","盐城|3209","扬州|3210","镇江|3211","泰州|3212","宿迁|3213");
$CityArr[33]=new Array("杭州|3301","宁波|3302","温州|3303","嘉兴|3304","湖州|3305","绍兴|3306","金华|3307","衢州|3308","舟山|3309","台州|3310","丽水|3311");
$CityArr[34]=new Array("合肥|3401","芜湖|3402","蚌埠|3403","淮南|3404","马鞍山|3405","淮北|3406","铜陵|3407","安庆|3408","黄山|3410","滁州|3411","阜阳|3412","宿州|3413","巢湖|3414","六安|3415","亳州|3416","池州|3417","宣城|3418");
$CityArr[35]=new Array("福州|3501","厦门|3502","莆田|3503","三明|3504","泉州|3505","漳州|3506","南平|3507","龙岩|3508","宁德|3509");
$CityArr[36]=new Array("南昌|3601","景德镇|3602","萍乡|3603","九江|3604","新余|3605","鹰潭|3606","赣州|3607","吉安|3608","宜春|3609","抚州|3610","上饶|3611");
$CityArr[37]=new Array("济南|3701","青岛|3702","淄博|3703","枣庄|3704","东营|3705","烟台|3706","潍坊|3707","济宁|3708","泰安|3709","威海|3710","日照|3711","莱芜|3712","临沂|3713","德州|3714","聊城|3715","滨州|3716","菏泽|3717");
$CityArr[41]=new Array("郑州|4101","开封|4102","洛阳|4103","平顶山|4104","安阳|4105","鹤壁|4106","新乡|4107","焦作|4108","濮阳|4109","许昌|4110","漯河|4111","三门峡|4112","南阳|4113","商丘|4114","信阳|4115","周口|4116","驻马店|4117","济源|4190");
$CityArr[42]=new Array("武汉|4201","黄石|4202","十堰|4203","宜昌|4205","襄樊|4206","鄂州|4207","荆门|4208","孝感|4209","荆州|4210","黄冈|4211","咸宁|4212","随州|4213","恩施|4228","仙桃|4294","潜江|4295","天门|4296","神农架|4221");
$CityArr[43]=new Array("长沙|4301","株洲|4302","湘潭|4303","衡阳|4304","邵阳|4305","岳阳|4306","常德|4307","张家界|4308","益阳|4309","郴州|4310","永州|4311","怀化|4312","娄底|4313","湘西|4331");
$CityArr[44]=new Array("广州|4401","韶关|4402","深圳|4403","珠海|4404","汕头|4405","佛山|4406","江门|4407","湛江|4408","茂名|4409","肇庆|4412","惠州|4413","梅州|4414","汕尾|4415","河源|4416","阳江|4417","清远|4418","东莞|4419","中山|4420","潮州|4451","揭阳|4452","云浮|4453");
$CityArr[45]=new Array("南宁|4501","柳州|4502","桂林|4503","梧州|4504","北海|4505","防城港|4506","钦州|4507","贵港|4508","玉林|4509","百色|4510","贺州|4511","河池|4512","来宾|4513","崇左|4514");
$CityArr[46]=new Array("海口|4601","三亚|4602","五指山|4691","琼海|4692","儋州|4693","文昌|4695","万宁|4696","东方|4697","定安|4621","屯昌|469022","澄迈|4623","临高|4624","白沙|4625","昌江|4626","乐东|4627","陵水|4628","保亭|4629","琼中|4630","西沙|4631","南沙|4632","中沙|4633");
$CityArr[50]=new Array("万州|5001","涪陵|5002","渝中|5003","大渡口|5004","江北|5005","沙坪坝|5006","九龙坡|5007","南岸|5008","北碚|5009","万盛|5010","双桥|5011","渝北|5012","巴南|5013","黔江|5014","长寿|5015","江津|5016","合川|5017","永川|5018","南川|5019","綦江|5022","潼南|5023","铜梁|5024","大足|5025","荣昌|5026","璧山|5027","梁平|5028","城口|5029","丰都|5030","垫江|5031","武隆|5032","忠县|5033","开县|5034","云阳|5035","奉节|5036","巫山|5037","巫溪|5038","石柱|5040","秀山|5041","酉阳|5042","彭水|5043");
$CityArr[51]=new Array("成都|5101","自贡|5103","攀枝花|5104","泸州|5105","德阳|5106","绵阳|5107","广元|5108","遂宁|5109","内江|5110","乐山|5111","南充|5113","眉山|5114","宜宾|5115","广安|5116","达州|5117","雅安|5118","巴中|5119","资阳|5120","阿坝|5132","甘孜|5133","凉山|5134");
$CityArr[52]=new Array("贵阳|5201","六盘水|5202","遵义|5203","安顺|5204","铜仁|5222","黔西南|5223","毕节|5224","黔东南|5226","黔南|5227");
$CityArr[53]=new Array("昆明|5301","曲靖|5303","玉溪|5304","保山|5305","昭通|5306","丽江|5307","普洱|5308","临沧|5309","楚雄|5323","红河|5325","文山|5326","西双版纳|5328","大理|5329","德宏|5331","怒江|5333","迪庆|5334");
$CityArr[54]=new Array("拉萨|5401","昌都|5421","山南|5422","日喀则|5423","那曲|5424","阿里|5425","林芝|5426");
$CityArr[61]=new Array("西安|6101","铜川|6102","宝鸡|6103","咸阳|6104","渭南|6105","延安|6106","汉中|6107","榆林|6108","安康|6109","商洛|6110");
$CityArr[62]=new Array("兰州|6201","嘉峪关|6202","金昌|6203","白银|6204","天水|6205","武威|6206","张掖|6207","平凉|6208","酒泉|6209","庆阳|6210","定西|6211","陇南|6212","临夏|6229","甘南|6230");
$CityArr[63]=new Array("西宁|6301","海东|6321","海北|6322","黄南|6323","海南|6325","果洛|6326","玉树|6327","海西|6328");
$CityArr[64]=new Array("银川|6401","石嘴山|6402","吴忠|6403","固原|6404","中卫|6405");
$CityArr[65]=new Array("乌鲁木齐|6501","克拉玛依|6502","吐鲁番|6521","哈密|6522","昌吉|6523","博尔塔拉|6527","巴音郭楞|6528","阿克苏|6529","克孜勒苏|6530","喀什|6531","和田|6532","伊犁|6540","塔城|6542","阿勒泰|6543","石河子|6591","阿拉尔|6592","图木舒克|6593","五家渠|6594");
$CityArr[71]=new Array("台湾|7101");
$CityArr[81]=new Array("香港|8101");
$CityArr[82]=new Array("澳门|8201");

function wrtCity($mycity){
	if($ProvsArr[Math.floor($mycity/10000)]){
	document.write("&nbsp;"+$ProvsArr[Math.floor($mycity/10000)]);
	}
	if($CityArr[Math.floor($mycity/10000)]){
	$nowcityarr=$CityArr[Math.floor($mycity/10000)];
		for (x in $nowcityarr){
			nowcity=$nowcityarr[x].split("|");
			if(nowcity.length>1){
				if(Math.floor(nowcity[1])==Math.floor($mycity/100)) document.write("，"+nowcity[0]);
			} 
		}
	
	}
}
 function getCity($mycity){
	backcitystr='';
	if($ProvsArr[Math.floor($mycity/10000)]){
	backcitystr="&nbsp;"+$ProvsArr[Math.floor($mycity/10000)];
	}
	if($CityArr[Math.floor($mycity/10000)]){
	$nowcityarr=$CityArr[Math.floor($mycity/10000)];
		for (x in $nowcityarr){
			nowcity=$nowcityarr[x].split("|");
			if(nowcity.length>1){
				if(Math.floor(nowcity[1])==Math.floor($mycity/100)) backcitystr+="，"+nowcity[0];
			} 
		}
	
	}
	return backcitystr;
}
  function provSta(obj,pvalue){
	obj.options.length = 0;
		obj.options.add(new Option("-省份-","0")); 
	for($mprov in $ProvsArr){
		if($mprov>10&&$mprov<84){
			obj.options.add(new Option($ProvsArr[$mprov],$mprov)); 
			if(Math.floor($mprov)==Math.floor(pvalue))obj.options[obj.options.length-1].selected = true;
		}
	}
}

function citySta(obj,cid,cvalue){
	if($CityArr[cid]){
	obj.options.length = 0;
	//obj.options.add(new Option("-城市-","0"));
	for(var i=0;i<$CityArr[cid].length; i++){
		mycity=$CityArr[cid][i].split("|");
		if(mycity[0]){
			obj.options.add(new Option(mycity[0],mycity[1])); 
			if(Math.floor(mycity[1])==Math.floor(cvalue))obj.options[obj.options.length-1].selected = true; 
		}
	}
	}
}
 
function citysSta(obj1,obj2,citycode){
	provSta(obj1,Math.floor(citycode/10000));
	citySta(obj2,Math.floor((citycode/10000)),Math.floor((citycode/100)));
}